app/Controllers/Api/ProjectController.php

INSERT INTO `projects` (`user_id`, `project_name`, `Project_buget`, `project_description`) VALUES (4, 'Project A', 10000, 'Description of Project A')
---
    public function addproject()
    {
        $validationrule=[
            "project_name"=>"required",
            "Project_buget"=>"required",
            "project_description"=>"required"
        ];
        if(!$this->validate($validationrule))
        {
            return $this->respond([
                 "ststus"=>false,
                 "message"=>"Fail to Register Due to Incomplete Fields",
                 "error"=>$this->validator->getErrors()
            ]);
        }
        $userID = auth()->user()->id;
       if($this->model->insert([
            "user_id"=> $userID,
            "project_name"=>$this->request->getVar("project_name"),
            "Project_buget"=>$this->request->getVar("Project_buget"),
            "project_description"=>$this->request->getVar("project_description"),
        ]))